Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: Whenever one of these input fields gets changed, the other one will also be changed to the same value.
it_it: Ogni volta che uno di questi campi di input viene modificato, anche l'altro verrà modificato con lo stesso valore.

source: Wherever a numerical value is needed, it can also be calculated during assembly.
it_it: Ovunque sia necessario un valore numerico, questo può essere calcolato anche durante l'assembly.

source: Which Interface to choose?
it_it: Quale interfaccia scegliere?

source: While a program is paused the actual position in the program is shown by a green arrow in the editor.
it_it: Quando un programma è in pausa, la posizione effettiva nel programma è indicata da una freccia verde nell'editor.

source: WiFi Bluetooth SoC module with 240MHz operating frequency
it_it: Modulo SoC WiFi Bluetooth con frequenza operativa di 240 MHz

source: With BLDC motor modules it is also possible to drive the motor using torque mode.
it_it: Con i moduli motore BLDC è anche possibile pilotare il motore utilizzando la modalità "torque" [coppia].

source: With Touch Version
it_it: Versione Con Touch

source: With a wide range of functions and interfaces, it can meet power consumption requirements in Internet of Things (IoT), mobile devices, smart home and other applications.
it_it: Grazie a un'ampia gamma di funzioni e interfacce, è in grado di soddisfare i requisiti di consumo energetico di applicazioni quali Internet of Things (IoT), dispositivi mobili, smart home e altre applicazioni.

source: With devices that support LSS the node ID and bit rate can be set using these functions.
it_it: Con i dispositivi che supportano LSS, l'ID nodo e il bit rate possono essere impostati utilizzando queste funzioni.

source: With most modules, all interfaces the module is equipped with can also be used for firmware updates.
it_it: Con la maggior parte dei moduli, tutte le interfacce di cui è dotato il modulo possono essere utilizzate anche per gli aggiornamenti del firmware.

source: With motion control modules that support the CiA-402 homing (hm) mode, the CiA-402 homing mode tool can be used.
it_it: Con i moduli di controllo del movimento che supportano la modalità di homing (hm) CiA-402, è possibile utilizzare lo strumento di modalità di homing CiA-402.

source: With motion control modules that support the CiA-402 profile position (pp) mode, the CiA-402 profile position mode tool can be used.
it_it: Con i moduli di controllo del movimento che supportano la modalità di posizione del profilo (pp) CiA-402, è possibile utilizzare il tool "profile position mode" CiA-402.

source: With motion control modules that support the CiA-402 profile velocity (pv) mode, the CiA-402 profile velocity mode tool can be used.
it_it: Con i moduli di controllo del movimento che supportano la modalità CiA-402 "profile velocity (pv)", è possibile utilizzare il tool "CiA-402 profile velocity mode".

source: With motion control modules that use the CiA-402 profile, the CiA-402 state machine tool can be used.
it_it: Con i moduli di controllo del movimento che utilizzano il profilo CiA-402, è possibile utilizzare il tool della macchina a stati CiA-402.

source: With some closed-loop stepper motor modules it is also possible to drive the stepper motor using torque mode.
it_it: Con alcuni moduli di motore passo-passo a circuito chiuso è anche possibile pilotare il motore passo-passo utilizzando la modalità "torque" [Coppia].

source: With some parameter combinations there are restrictions concerning the acceleration value.
it_it: Alcune combinazioni di parametri presentano delle restrizioni relative al valore di accelerazione.

source: With the help of the closed-loop tool it is possible to activate and to tune the closed-loop feature of such modules.
it_it: Con l'aiuto dello strumento closed-loop è possibile attivare e regolare la funzionalità a ciclo chiuso di tali moduli.

source: With the help of this tool it is possible to look into all registers of a chip an also to change the contents of the registers.
it_it: Con l'aiuto di questo strumento è possibile esaminare tutti i registri di un chip e anche modificarne il contenuto.

source: With this option turned off the assembler dialog will be closed automatically on success.
it_it: Se questa opzione è disattivata, la finestra di dialogo dell'assembler verrà chiusa automaticamente in caso di successo.

source: Without Touch Version
it_it: Versione Senza Touch

source: Working Time: 9 AM - 6 PM GMT+8 (Monday to Friday)
it_it: Orario di lavoro: 9:00 - 18:00 GMT+8 (dal lunedì al venerdì)

source: Working with Arduino
it_it: Lavorare con Arduino

source: Working with ESP-IDF
it_it: Utilizzo di ESP-IDF

source: Write output to binary file: The assembler writes its output also to a binary file.
it_it: Write output to binary file: L'assembler scrive il suo output anche in un file binario.

source: X: parameter can be saved using the Import/Export tool
it_it: X: il parametro può essere salvato utilizzando il tool Import/Export

source: Yellow: This color means that there might be some low vibration at this velocity.
it_it: Giallo: Questo colore significa che a questa velocità potrebbero verificarsi vibrazioni ridotte.

source: Yes, you can also customize the frequency of consecutive frames.
it_it: Sì, è anche possibile personalizzare la frequenza dei frame consecutivi.

source: You can click on the link at the bottom to open this file with your system editor to view and save the content.
it_it: È possibile cliccare sul link in basso per aprire questo file con l'editor di sistema e visualizzarne e salvarne il contenuto.

source: You can exit the debugger by clicking Debugger active in the Debug menu or the Debugger icon on the tool bar once again.
it_it: È possibile uscire dal debugger cliccando su Debugger active nel menù Debug oppure nuovamente sull'icona Debugger sulla barra degli strumenti.

source: You can refer to the following steps to run the demo for comparison:
it_it: Per eseguire la demo a scopo di confronto, è possibile fare riferimento ai seguenti passaggi:

source: You can set the board to download mode to solve this issue.
it_it: È possibile impostare la scheda in modalità download per risolvere questo problema.

source: You can then choose to run different LVGL demos such as lv_demo_stress, lv_demo_benchmark, lv_demo_music, lv_demo_widgets, or example_lvgl_demo_ui etc.
it_it: Si può quindi scegliere di eseguire diverse demo LVGL come lv_demo_stress, lv_demo_benchmark, lv_demo_music, lv_demo_widgets o example_lvgl_demo_ui ecc.

source: You can then drag each flag to the toolbar.
it_it: È quindi possibile trascinare ciascun flag sulla barra degli strumenti.

source: You do not have to care about this checkbox when not using DCF file generation.
it_it: Non è necessario controllare questa checkbox se non si utilizza la generazione di file DCF.

source: You need to copy the PCANBasic.dll (from the Peak CD/DVD or from the product CD section of the Peak website) manually to your Windows System directory.
it_it: È necessario copiare manualmente il file PCANBasic.dll (dal CD/DVD Peak o dalla sezione CD del prodotto del sito web Peak) nella directory di Sistema di Windows.

source: bin file path:
it_it: Path del file bin:

source: ch34x_pis* and tty*
it_it: ch34x_pis* e tty*

source: example.py corresponds to the reference example "../OLED_Module_Code/RaspberryPi/python/lib/waveshare_OLED/OLED_0in96_test.py", and is the mainstream program.
it_it: example.py corrisponde all'esempio di riferimento "../OLED_Module_Code/RaspberryPi/python/lib/waveshare_OLED/OLED_0in96_test.py" ed è il programma principale.

source: if argument=0
it_it: se argomento = 0

source: if argument>0
it_it: se argomento > 0

source: loop function is the main loop part of the program, and its main function is to implement simple 485 communication data return
it_it: loop è la parte principale del programma, e la sua funzione principale è implementare un semplice ritorno di dati di comunicazione 485.

source: loop function is the main loop part of the program, and its main function is to implement simple UART communication data return
it_it: loop è la parte principale del programma e la sua funzione principale è implementare una semplice comunicazione UART.

source: loop()The function is the main loop part of the program, and its core function is to scan devices on the I2C bus.
it_it: loop()La funzione è la parte principale del programma, ovvero il loop, e la sua funzione principale è la scansione dei dispositivi sul bus I2C.

source: setup function is primarily used for initializing serial communication
it_it: setup viene utilizzata principalmente per inizializzare la comunicazione seriale.

source: setup function mainly performs a series of initialization operations and tests on the TF card
it_it: setup esegue principalmente una serie di operazioni di inizializzazione e test sulla scheda TF

source: smartEnergy threshold speed: above this speed, CoolStep can be activated.
it_it: smartEnergy threshold speed: al di sopra di questa velocità, è possibile attivare CoolStep.

source: stall velocity threshold (SAP 181), also called stop-on-stall velocity threshold: the motor will be stopped automatically if a stall has been detected and the actual velocity is higher than this value.
it_it: stall velocity threshold (SAP 181), detta anche soglia di velocità di stop-on-stall: il motore si arresta automaticamente se viene rilevato uno stallo e la velocità effettiva è superiore a questo valore.

source: stallGuard threshold (SAP 174): this value controls the threshold level for stall detection and sets the optimum measurement range for the load value readout.
it_it: stallGuard threshold (SAP 174): questo valore controlla il livello di soglia per il rilevamento dello stallo e imposta l'intervallo di misurazione ottimale per la lettura del valore del carico.

source: telnet.exe Localhost 4444 (Return the result according to the above)
it_it: telnet.exe Localhost 4444 (Restituisce il risultato in base a quanto sopra)

source: toughened glass
it_it: Vetro temprato

source: tty* and tty* (often ttyACM*)
it_it: tty* e tty* (spesso ttyACM*)

source: v0.0.4 or later
it_it: v0.0.4 o successive

source: v0.1.4 and above
it_it: v0.1.4 e successive

source: waveshare_twai_transmit() function primarily handles the transmission and alarm processing for TWAI (an interface similar to CAN bus)
it_it: waveshare_twai_transmit() gestisce principalmente la trasmissione e l'elaborazione degli allarmi per TWAI (un'interfaccia simile al CAN bus)

source: x86_64 (64-bit but not Raspberry Pi)
it_it: x86_64 (64-bit ma non Raspberry Pi)

source: – Assembler/Debugger: Opens the Assembler/Debugger Options dialog.
it_it: – Assembler/Debugger: Apre la dialog Assembler/Debugger Options.

source: – Module Assignments: Opens the Module Assignments dialog.
it_it: – Module Assignments: Apre la dialog Module Assignments.

source: – PCANBasic.dll 32 bit to Windows\SysWOW64
it_it: – PCANBasic.dll 32 bit in Windows\SysWOW64

source: – PCANBasic.dll 32 bit to Windows\System32.
it_it: – PCANBasic.dll 32 bit in Windows\System32.

source: – PCANBasic.dll 64 bit to Windows\System32
it_it: – PCANBasic.dll 64 bit in Windows\System32

source: ① If you are using more than one USB TO UART/I2C/SPI/JTAG device at the same time, please select the device at ① in the CH347T_Config.py file (similar to the device serial number, 0, 1, 2... etc.)
it_it: ① Se si usano più di un dispositivo "USB TO UART/I2C/SPI/JTAG" contemporaneamente, selezionare quello al punto ① nel file CH347T_Config.py (simile al numero di serie del dispositivo, 0, 1, 2... ecc.)

source: ① If you are using multiple USB TO UART/I2C/SPI/JTAG devices at the same time, please select the device at ① (similar to the device serial number, 0, 1, 2... etc.)
it_it: ① Se si usano più dispositivi "USB TO UART/I2C/SPI/JTAG" contemporaneamente, selezionare il dispositivo in ① (simile al numero di serie del dispositivo, 0, 1, 2... ecc.)

source: ①.ESP-IDF Development Environment Version Manager, when our project requires differentiation of development environment versions, it can be managed by installing different versions of ESP-IDF.
it_it: ①.Gestore delle versioni dell'ambiente di sviluppo ESP-IDF: quando il progetto richiede la differenziazione delle versioni dell'ambiente di sviluppo, è possibile gestirlo installando diverse versioni di ESP-IDF.

source: ①Select the corresponding demo
it_it: ① Selezionare la demo corrispondente

source: ②.Device flashing COM port, select to flash the compiled program into the chip
it_it: ②.Porta COM flash del dispositivo, selezionare per flashare il programma compilato nel chip

source: ②Its readme will state what chip the demo applies to (how to use the demo and the file structure are described below, omitted here)
it_it: ② Il suo readme indicherà a quale chip si applica la demo (le modalità di utilizzo della demo e la struttura dei file sono descritte di seguito, omesse qui)

source: ②Modify the I2C device address according to the actual need to operate.
it_it: ②Modificare l'indirizzo del dispositivo I2C in base alle effettive esigenze operative.

source: ③.Select set-target chip model, select the corresponding chip model, for example, ESP32-P4-NANO needs to choose esp32p4 as the target chip
it_it: ③.Selezionare il modello di chip target impostato, selezionare il modello di chip corrispondente, ad esempio, ESP32-P4-NANO deve scegliere esp32p4 come chip target

source: ③Click to create the demo
it_it: ③ Cliccare per creare la demo

source: ④.menuconfig, click it to Modify sdkconfig configuration file Project configuration details
it_it: ④.menuconfig, cliccarci sopra per modificare il file di configurazione sdkconfig Dettagli di configurazione del progetto

source: ⑤.fullclean button, when the project compilation error or other operations pollute the compiled content, you can clean up all the compiled content by clicking it
it_it: ⑤.Pulsante fullclean: quando un errore di compilazione del progetto o altre operazioni inquinano il contenuto compilato, è possibile ripulirlo completamente cliccandoci sopra.

source: ⑥.Build project, when a project satisfies the build, click this button to compile
it_it: ⑥.Build project, quando un progetto soddisfa i requisiti di build, fare clic su questo pulsante per compilarlo

source: ⑦.Current download mode, the default is UART
it_it: ⑦.Modalità di download corrente: l'impostazione predefinita è UART.

source: ⑧.flash button, when a project build is completed, select the COM port of the corresponding development board, and click this button to flash the compiled firmware to the chip
it_it: ⑧.Pulsante flash: quando la build di un progetto è completata, selezionare la porta COM della scheda di sviluppo corrispondente e fare clic su questo pulsante per flashare il firmware compilato sul chip.

source: ⑨.monitor enable flashing port monitoring, when a project passes through Build --> Flash, click this button to view the log of output from flashing port and debugging port, so as to observe whether the application works normally
it_it: ⑨.monitor abilita il monitoraggio della porta flash. Quando un progetto passa attraverso Build --> Flash, fare clic su questo pulsante per visualizzare il log dell'output dalla porta flash e dalla porta di debug, in modo da verificare il corretto funzionamento dell'applicazione.

source: ⑪.Build Flash Monitor one-click button, which is used to continuously execute Build --> Flash --> Monitor, often referred to as "little flame"
it_it: ⑪.Pulsante Build Flash Monitor: con un clic, viene utilizzato per eseguire in modo continuo Build --> Flash --> Monitor, spesso definito "little flame" (piccola fiamma).
